Revit 2024 API
FluidTemperature.Dispose Method
Releases all resources used by the FluidTemperature
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace